## A short note on pandas library

pandas is a Python library which provides data manipulation tools and data structures.

In [1]:
import pandas as pd

In [11]:
title_df = pd.read_csv('titles.csv', encoding='UTF-8')
head = title_df.head()  # Returns first five rows in the data frame
head

             title  year
0   Orlando Vargas  2005
1         Niu-Peng  1989
2    Anandabhadram  2005
3   Mahendra Varma  1993
4  Beomdiga shidae  1970

In [14]:
head_mulby_10 = head['year'] / 10 # operation will be done to every column specified
head_mulby_10

0    200.5
1    198.9
2    200.5
3    199.3
4    197.0
Name: year, dtype: float64

In [27]:
# Returns a dataframe of years only less than 2000
title_before_2000 = title_df[title_df.year < 2000].head()  
type(title_before_2000)

pandas.core.frame.DataFrame

In [32]:
# Sorting by an attribute
sort_by_year = title_df.sort_values('year').head()
sort_by_year

                                                    title  year
90767                                          Miss Jerry  1894
10994   Reproduction of the Corbett and Fitzsimmons Fight  1897
125276  Battle of Jeffries and Sharkey for Championshi...  1899
37542                            Jeffries-Sharkey Contest  1899
307        Reproduction of the Corbett and Jeffries Fight  1899

In [42]:
# Attaches a frequency to each value of year
value_count = title_df.year.value_counts()
value_count

2015    13623
2014     8320
2013     7735
2012     7331
2011     6905
2010     6321
2009     6015
2008     4960
2016     4918
2007     4249
2006     4116
2005     3725
2004     3352
2003     3029
2002     2879
2001     2737
2000     2644
1999     2420
1998     2318
1997     2233
1990     2195
1988     2165
1987     2125
1989     2125
1991     2119
1992     2080
1970     2035
1996     2023
1995     2000
1969     1984
        ...
1947      818
1930      811
1924      801
1946      760
1943      751
1929      740
1923      717
1944      706
1945      635
1914      546
1913      242
2018      224
1912      104
1911       61
2019       37
2020       30
1910       25
1909       14
1908        6
1906        5
2021        5
1907        4
1900        4
1899        4
2022        3
1905        2
1903        1
1897        1
2024        1
1894        1
Name: year, Length: 124, dtype: int64

In [39]:
# Changes the automatic inde to specified (year)
year_index = title_df.set_index('year')
year_index.head()

                title
year
2005   Orlando Vargas
1989         Niu-Peng
2005    Anandabhadram
1993   Mahendra Varma
1970  Beomdiga shidae